In [1]:
people={'first':['saran','arun','praveen'],
        'last':['bharath','mahesh','mahesh'],
        'email':['saranpvr@gmail.com','bharathguj@gmail.com','arjunpvr@gmail.com']}

In [2]:
import pandas as pd
df=pd.DataFrame(people)

In [3]:
df

     first     last                 email
0    saran  bharath    saranpvr@gmail.com
1     arun   mahesh  bharathguj@gmail.com
2  praveen   mahesh    arjunpvr@gmail.com

In [4]:
df.drop(columns=['last'])

     first                 email
0    saran    saranpvr@gmail.com
1     arun  bharathguj@gmail.com
2  praveen    arjunpvr@gmail.com

In [5]:
df

     first     last                 email
0    saran  bharath    saranpvr@gmail.com
1     arun   mahesh  bharathguj@gmail.com
2  praveen   mahesh    arjunpvr@gmail.com

In [6]:
df['first']+' '

0      saran
1       arun
2    praveen
Name: first, dtype: object

In [7]:
df['full_name']=df['first']+' '+df['last']
df

     first     last                 email       full_name
0    saran  bharath    saranpvr@gmail.com   saran bharath
1     arun   mahesh  bharathguj@gmail.com     arun mahesh
2  praveen   mahesh    arjunpvr@gmail.com  praveen mahesh

In [8]:
df[df['last']=='bharath']

   first     last               email      full_name
0  saran  bharath  saranpvr@gmail.com  saran bharath

In [9]:
b=df['last']=='mahesh'
df[b]

     first    last                 email       full_name
1     arun  mahesh  bharathguj@gmail.com     arun mahesh
2  praveen  mahesh    arjunpvr@gmail.com  praveen mahesh

In [10]:
df.loc[b,'last']

1    mahesh
2    mahesh
Name: last, dtype: object

In [11]:
c=(df['first']=='arun') & (df['last']=='mahesh')
df.loc[c,'email']

1    bharathguj@gmail.com
Name: email, dtype: object

In [12]:
df.loc[2,'last']='rajesh'
df

     first     last                 email       full_name
0    saran  bharath    saranpvr@gmail.com   saran bharath
1     arun   mahesh  bharathguj@gmail.com     arun mahesh
2  praveen   rajesh    arjunpvr@gmail.com  praveen mahesh

In [13]:
df.at[2,'last']='mahesh'
df

     first     last                 email       full_name
0    saran  bharath    saranpvr@gmail.com   saran bharath
1     arun   mahesh  bharathguj@gmail.com     arun mahesh
2  praveen   mahesh    arjunpvr@gmail.com  praveen mahesh

In [14]:
df['email'].apply(len)

0    18
1    20
2    18
Name: email, dtype: int64

In [15]:
def update_email(email):
    return email.upper()

In [16]:
df['email'].apply(update_email)

0      SARANPVR@GMAIL.COM
1    BHARATHGUJ@GMAIL.COM
2      ARJUNPVR@GMAIL.COM
Name: email, dtype: object

In [17]:
df['email']=df['email'].apply(update_email)
df

     first     last                 email       full_name
0    saran  bharath    SARANPVR@GMAIL.COM   saran bharath
1     arun   mahesh  BHARATHGUJ@GMAIL.COM     arun mahesh
2  praveen   mahesh    ARJUNPVR@GMAIL.COM  praveen mahesh

In [18]:
df['email']=df['email'].apply(lambda x: x.lower())
df

     first     last                 email       full_name
0    saran  bharath    saranpvr@gmail.com   saran bharath
1     arun   mahesh  bharathguj@gmail.com     arun mahesh
2  praveen   mahesh    arjunpvr@gmail.com  praveen mahesh

In [19]:
df['email'].apply(len)

0    18
1    20
2    18
Name: email, dtype: int64

In [20]:
df.apply(len)

first        3
last         3
email        3
full_name    3
dtype: int64

In [21]:
df.apply(len,axis='columns')

0    4
1    4
2    4
dtype: int64

In [22]:
len(df['email'])

3

In [23]:
df.apply(pd.Series.min)

first                      arun
last                    bharath
email        arjunpvr@gmail.com
full_name           arun mahesh
dtype: object

In [24]:
df.apply(lambda x:x.min())

first                      arun
last                    bharath
email        arjunpvr@gmail.com
full_name           arun mahesh
dtype: object

In [25]:
df.applymap(len)

   first  last  email  full_name
0      5     7     18         13
1      4     6     20         11
2      7     6     18         14

In [26]:
df.applymap(str.lower)

     first     last                 email       full_name
0    saran  bharath    saranpvr@gmail.com   saran bharath
1     arun   mahesh  bharathguj@gmail.com     arun mahesh
2  praveen   mahesh    arjunpvr@gmail.com  praveen mahesh

In [27]:
df.applymap(str.upper)

     first     last                 email       full_name
0    SARAN  BHARATH    SARANPVR@GMAIL.COM   SARAN BHARATH
1     ARUN   MAHESH  BHARATHGUJ@GMAIL.COM     ARUN MAHESH
2  PRAVEEN   MAHESH    ARJUNPVR@GMAIL.COM  PRAVEEN MAHESH

In [28]:
df['first'].map({'saran':'kukku','arun':'aniyan'})

0     kukku
1    aniyan
2       NaN
Name: first, dtype: object

In [29]:
df['first']=df['first'].replace({'saran':'kukku','arun':'aniyan'})
df

     first     last                 email       full_name
0    kukku  bharath    saranpvr@gmail.com   saran bharath
1   aniyan   mahesh  bharathguj@gmail.com     arun mahesh
2  praveen   mahesh    arjunpvr@gmail.com  praveen mahesh

In [30]:
df['full_name'].str.split(' ',expand=True)

         0        1
0    saran  bharath
1     arun   mahesh
2  praveen   mahesh

In [31]:
df[['first','last']]=df['full_name'].str.split(' ',expand=True)

In [32]:
df

     first     last                 email       full_name
0    saran  bharath    saranpvr@gmail.com   saran bharath
1     arun   mahesh  bharathguj@gmail.com     arun mahesh
2  praveen   mahesh    arjunpvr@gmail.com  praveen mahesh

In [35]:
df.append({'first':'kannan'},ignore_index=True)

     first     last                 email       full_name
0    saran  bharath    saranpvr@gmail.com   saran bharath
1     arun   mahesh  bharathguj@gmail.com     arun mahesh
2  praveen   mahesh    arjunpvr@gmail.com  praveen mahesh
3   kannan      NaN                   NaN             NaN

In [38]:
people={'first':['jesse','william'],
        'second':['ovens','wallace'],
        'third':['jesse_ovens@gmail.com','william_wallace@hotmail.com']}
df2=pd.DataFrame(people)
df2

     first   second                        third
0    jesse    ovens        jesse_ovens@gmail.com
1  william  wallace  william_wallace@hotmail.com

In [46]:
df.append(df2,ignore_index=True,sort=False)

,first,last,email,full_name,second,third
0,saran,bharath,saranpvr@gmail.com,saran bharath,NaN,NaN
1,arun,mahesh,bharathguj@gmail.com,arun mahesh,NaN,NaN
2,praveen,mahesh,arjunpvr@gmail.com,praveen mahesh,NaN,NaN
3,jesse,NaN,NaN,NaN,ovens,jesse_ovens@gmail.com
4,william,NaN,NaN,NaN,wallace,william_wallace@hotmail.com

In [48]:
df=df.append(df2,ignore_index=True,sort=False)
df

,first,last,email,full_name,second,third
0,saran,bharath,saranpvr@gmail.com,saran bharath,NaN,NaN
1,arun,mahesh,bharathguj@gmail.com,arun mahesh,NaN,NaN
2,praveen,mahesh,arjunpvr@gmail.com,praveen mahesh,NaN,NaN
3,jesse,NaN,NaN,NaN,ovens,jesse_ovens@gmail.com
4,william,NaN,NaN,NaN,wallace,william_wallace@hotmail.com

In [49]:
df.drop(index=4)

,first,last,email,full_name,second,third
0,saran,bharath,saranpvr@gmail.com,saran bharath,NaN,NaN
1,arun,mahesh,bharathguj@gmail.com,arun mahesh,NaN,NaN
2,praveen,mahesh,arjunpvr@gmail.com,praveen mahesh,NaN,NaN
3,jesse,NaN,NaN,NaN,ovens,jesse_ovens@gmail.com

In [52]:
f=df['last']=='mahesh'
df.drop(index=df[f].index)

,first,last,email,full_name,second,third
0,saran,bharath,saranpvr@gmail.com,saran bharath,NaN,NaN
3,jesse,NaN,NaN,NaN,ovens,jesse_ovens@gmail.com
4,william,NaN,NaN,NaN,wallace,william_wallace@hotmail.com